Revit 2027 API
ScheduleFilter.IsElementIdValue Property
 Indicates if the filter has an ElementId value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElementIdValue { get; }
Public ReadOnly Property IsElementIdValue As Boolean
	Get
public:
property bool IsElementIdValue {
	bool get ();
}
member IsElementIdValue : bool with get
Property Value
Boolean
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace